# GetStatus Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transaction..::..GetStatus Method
Transaction Class See Also
---
Returns the current status of the transaction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TransactionStatus GetStatus()
```

Visual Basic
---
```text
Public Function GetStatus As TransactionStatus
```

Visual C++
---
```text
public:
TransactionStatus GetStatus()
```

# ### Return Value
The current status of the transaction.
# Remarks
If the status was set to TransactionStatus.Pending as the result of calling Commit or RollBack, the status will be changed later to either 'Committed' or 'RolledBack' after failure handling is finished. That status change will be made asynchronously.
# See Also
Transaction Class
Autodesk.Revit.DB Namespace